// ภาพวาดรูปแบบหนึ่งที่มักเห็นประจำในอินเดียก็คือ ภาพวาดที่เรียกว่า รังโกลี (Rangoli) ซึ่งเป็นรูปแบบหนึ่งของศิลปะที่นิยมมากที่สุดในอินเดียก็ว่าได้ เป็นการวาดภาพด้วยทรายหรือผงสี บนพื้นขาวหรือพื้นสี ซึ่งมักใช้ตกแต่งหน้าบ้านของชาวอินเดียในงานเทศกาลต่างๆ หรือในสถานที่จัดงานสำคัญๆ หมายถึงการต้อนรับขับสู้อย่างอบอุ่นของเจ้าบ้านหรือเจ้าภาพต่อแขกที่มาเยือน

// ในข้อนี้จะให้เขียนโปรแกรมเพื่อวาดภาพรังโกลี จากตัวอักษรภาษาอังกฤษ โดยรับข้อมูลเป็นจำนวนเต็มบวก N (N <= 26) ซึ่งเป็นขนาดของภาพรังโกลี และเป็นลำดับอักษรภาษาอังกฤษสูงสุดที่ใช้ในภาพ เช่น N = 3 หมายถึงใช้ตัวอักษรภาษาอังกฤษ a, b และ c เท่านั้น

// ขนาดของภาพรังโกลีมีลักษณะดังนี้

// #Size N = 3
// ----c----
// --c-b-c--
// c-b-a-b-c
// --c-b-c--
// ----c----

// #Size N = 10
// ------------------j------------------
// ----------------j-i-j----------------
// --------------j-i-h-i-j--------------
// ------------j-i-h-g-h-i-j------------
// ----------j-i-h-g-f-g-h-i-j----------
// --------j-i-h-g-f-e-f-g-h-i-j--------
// ------j-i-h-g-f-e-d-e-f-g-h-i-j------
// ----j-i-h-g-f-e-d-c-d-e-f-g-h-i-j----
// --j-i-h-g-f-e-d-c-b-c-d-e-f-g-h-i-j--
// j-i-h-g-f-e-d-c-b-a-b-c-d-e-f-g-h-i-j
// --j-i-h-g-f-e-d-c-b-c-d-e-f-g-h-i-j--
// ----j-i-h-g-f-e-d-c-d-e-f-g-h-i-j----
// ------j-i-h-g-f-e-d-e-f-g-h-i-j------
// --------j-i-h-g-f-e-f-g-h-i-j--------
// ----------j-i-h-g-f-g-h-i-j----------
// ------------j-i-h-g-h-i-j------------
// --------------j-i-h-i-j--------------
// ----------------j-i-j----------------
// ------------------j------------------

// จากภาพรังโกลีขนาด 10 จะเห็นว่า ตัวอักษรที่ใช้วาดตัวนอกสุดคือ j ซึ่งเป็นตัวอักษรตัวที่ 10 ในภาษาอังกฤษ ถัดมาข้างในเป็น i, h, g, f, e, d, c, b, และ a ตามลำดับ

// หมายเหตุ

// หากสร้างภาพรังโกลีไม่ได้ ให้พิมพ์ -
// ตัวอย่างโปรแกรม 1

// 10
// ------------------j------------------
// ----------------j-i-j----------------
// --------------j-i-h-i-j--------------
// ------------j-i-h-g-h-i-j------------
// ----------j-i-h-g-f-g-h-i-j----------
// --------j-i-h-g-f-e-f-g-h-i-j--------
// ------j-i-h-g-f-e-d-e-f-g-h-i-j------
// ----j-i-h-g-f-e-d-c-d-e-f-g-h-i-j----
// --j-i-h-g-f-e-d-c-b-c-d-e-f-g-h-i-j--
// j-i-h-g-f-e-d-c-b-a-b-c-d-e-f-g-h-i-j
// --j-i-h-g-f-e-d-c-b-c-d-e-f-g-h-i-j--
// ----j-i-h-g-f-e-d-c-d-e-f-g-h-i-j----
// ------j-i-h-g-f-e-d-e-f-g-h-i-j------
// --------j-i-h-g-f-e-f-g-h-i-j--------
// ----------j-i-h-g-f-g-h-i-j----------
// ------------j-i-h-g-h-i-j------------
// --------------j-i-h-i-j--------------
// ----------------j-i-j----------------
// ------------------j------------------
// ตัวอย่างโปรแกรม 2

// 0
// -
#include <stdio.h>

int main(){
    int i, s;
    scanf("%d", &i);

    if(i<=0||i>26){
        printf("-");}
    else{
    for(s=i;s>0;s--){
        for(int mi=2*s-2;mi>0;mi--){
            printf("-");}
        for(int a=96+i;a>=96+s;a--){
            if(a==96+s){
                printf("%c",a);}
            else{
                printf("%c-",a);}}
        for(int as2=97+s;as2<=96+i;as2++){
            printf("-%c", as2);}
        for(int mi2=1;mi2<=2*s-2;mi2++){
            printf("-");}
        printf("\n");}
    for(int spn=2;spn<=i;spn++){
        for(int minn=2*spn-2;minn>0;minn--){
            printf("-");}
        for(int asun=96+i;asun>=96+spn;asun--){
            if(asun==96+spn){
                printf("%c", asun);}
            else{
                printf("%c-", asun);}}
        for(int asn2=97+spn;asn2<=96+i;asn2++){
            printf("-%c", asn2);}
        for(int minn2=1;minn2<=2*spn-2;minn2++){
            printf("-");}
        printf("\n");}
    }
}