// เส้นทางแห่งนักบวช
// หมากรุกสากลเป็นเกมส์ที่เล่นบนกระดานตารางขนาด 8x8 ช่อง โดยตัวนักบวช (Bishop) นั้นสามารถเดินเป็นเฉียงได้สี่ทิศทาง (ซ้ายบน ขวาบน ซ้ายล่าง ขวาล่าง) และระยะการเดินนั้นไม่จำกัด (ยกเว้นสุดขอบกระดาน) ให้นิสิตเขียนฟังก์ชัน bishopMoves() ซึ่งรับตำแหน่งของนักบวชมา แล้วกำหนดตำแหน่งที่นักบวชเดินไปได้ โดยกำหนดให้ช่องซ้ายบนสุดมีตำแหน่งเป็น 0 0 และช่องขวามือล่างสุดมีตำแหน่งเป็น 7 7

// จากนั้นให้นิสิตพิมพ์ตารางหมากรุกโดยแสดงตำแหน่งของนักบวชด้วยอักษร B และแสดงตำแหน่งที่นักบวชเดินไปได้ด้วยอักษร X ถ้านักบวชเดินไปยังตำแหน่งนั้นไม่ได้ให้พิมพ์ช่องว่าง (space bar)

// ตัวอย่างผลลัพธ์ที่ 1
// Enter Bishop's X Y position: 3 4
//   0 1 2 3 4 5 6 7
// ------------------
// 0| | | | | | | |X|
// ------------------
// 1|X| | | | | |X| |
// ------------------
// 2| |X| | | |X| | |
// ------------------
// 3| | |X| |X| | | |
// ------------------
// 4| | | |B| | | | |
// ------------------
// 5| | |X| |X| | | |
// ------------------
// 6| |X| | | |X| | |
// ------------------
// 7|X| | | | | |X| |
// ------------------
#include <stdio.h>
#define BOARD_SIZE 8
void bishopMoves(char xr[BOARD_SIZE][BOARD_SIZE],int x,int y){
  for(int i=0;i<BOARD_SIZE;i++){
    for(int o =0;o<BOARD_SIZE;o++){
        if (i+o== x+y || i-o==x-y){xr[o][i]='X';}}}  
    xr[y][x]='B';
}
int main() {
    char xr[BOARD_SIZE][BOARD_SIZE];int x,y;
    printf("Enter Bishop's X Y position: ");
    scanf("%d %d",&x,&y);
    for(int i=0;i<BOARD_SIZE;i++){
        for(int o=0;o<BOARD_SIZE;o++){
        xr[i][o]=' ';}
    }
    bishopMoves(xr,x,y);
    printf("  0 1 2 3 4 5 6 7\n------------------\n");
    for(int i=0;i<BOARD_SIZE;i++){
        printf("%d|",i);
        for(int o=0;o<BOARD_SIZE;o++){
        printf("%c|",xr[i][o]);}
        printf("\n------------------");
        printf("\n");}
}
